gorbukov/AsmEdit4/inf/STM32/MCU/STM32W/STM32WBxxx_CM4.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>COMP</name>
         <description>Comparator instance 1</description>
         <groupName>COMP</groupName>
         <baseAddress>0x40010200</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x9</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>COMP</name>
            <description>COMP2 &amp; COMP1 interrupt through
        AIEC[21:20]</description>
            <value>22</value>
         </interrupt>
         <registers>
            <register>
               <name>COMP1_CSR</name>
               <displayName>COMP1_CSR</displayName>
               <description>Comparator control and status           register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>COMP1_EN</name>
                     <description>Comparator enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>COMP1_PWRMODE</name>
                     <description>Comparator power mode</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>COMP1_INMSEL</name>
                     <description>Comparator input minus               selection</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>COMP1_INPSEL</name>
                     <description>Comparator input plus               selection</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>COMP1_POLARITY</name>
                     <description>Comparator output polarity</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>COMP1_HYST</name>
                     <description>Comparator hysteresis</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>COMP1_BLANKING</name>
                     <description>Comparator blanking source</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>COMP1_BRGEN</name>
                     <description>Comparator voltage scaler               enable</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>COMP1_SCALEN</name>
                     <description>Comparator scaler bridge               enable</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>COMP1_INMESEL</name>
                     <description>Comparator input minus extended               selection</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>COMP1_VALUE</name>
                     <description>Comparator output level</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>COMP1_LOCK</name>
                     <description>Comparator lock</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>COMP2_CSR</name>
               <displayName>COMP2_CSR</displayName>
               <description>Comparator 2 control and status           register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>COMP2_EN</name>
                     <description>Comparator 2 enable bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>COMP2_PWRMODE</name>
                     <description>Power Mode of the comparator               2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>COMP2_INMSEL</name>
                     <description>Comparator 2 input minus selection               bits</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>COMP2_INPSEL</name>
                     <description>Comparator 1 input plus selection               bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>COMP2_WINMODE</name>
                     <description>Windows mode selection bit</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>COMP2_POLARITY</name>
                     <description>Comparator 2 polarity selection               bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>COMP2_HYST</name>
                     <description>Comparator 2 hysteresis selection               bits</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>COMP2_BLANKING</name>
                     <description>Comparator 2 blanking source selection               bits</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>COMP2_BRGEN</name>
                     <description>Scaler bridge enable</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>COMP2_SCALEN</name>
                     <description>Voltage scaler enable bit</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>COMP2_INMESEL</name>
                     <description>comparator 2 input minus extended               selection bits.</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>COMP2_VALUE</name>
                     <description>Comparator 2 output status               bit</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>COMP2_LOCK</name>
                     <description>CSR register lock bit</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
