gorbukov/AsmEdit4/inf/STM32/MCU/STM32W/STM32WBxxx_CM4.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>IPCC</name>
         <description>IPCC</description>
         <groupName>IPCC</groupName>
         <baseAddress>0x58000C00</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>IPCC_C1_RX_IT</name>
            <description>IPCC CPU1 RX occupied interrupt</description>
            <value>44</value>
         </interrupt>
         <interrupt>
            <name>IPCC_C1_TX_IT</name>
            <description>IPCC CPU1 TX free interrupt</description>
            <value>45</value>
         </interrupt>
         <registers>
            <register>
               <name>C1CR</name>
               <displayName>C1CR</displayName>
               <description>Control register CPU1</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TXFIE</name>
                     <description>processor 1 Transmit channel free               interrupt enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXOIE</name>
                     <description>processor 1 Receive channel occupied               interrupt enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>C1MR</name>
               <displayName>C1MR</displayName>
               <description>Mask register CPU1</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0xFFFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>CH6FM</name>
                     <description>processor 1 Transmit channel 6 free               interrupt mask</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH5FM</name>
                     <description>processor 1 Transmit channel 5 free               interrupt mask</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH4FM</name>
                     <description>processor 1 Transmit channel 4 free               interrupt mask</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH3FM</name>
                     <description>processor 1 Transmit channel 3 free               interrupt mask</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH2FM</name>
                     <description>processor 1 Transmit channel 2 free               interrupt mask</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH1FM</name>
                     <description>processor 1 Transmit channel 1 free               interrupt mask</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH6OM</name>
                     <description>processor 1 Receive channel 6 occupied               interrupt enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH5OM</name>
                     <description>processor 1 Receive channel 5 occupied               interrupt enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH4OM</name>
                     <description>processor 1 Receive channel 4 occupied               interrupt enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH3OM</name>
                     <description>processor 1 Receive channel 3 occupied               interrupt enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH2OM</name>
                     <description>processor 1 Receive channel 2 occupied               interrupt enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH1OM</name>
                     <description>processor 1 Receive channel 1 occupied               interrupt enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>C1SCR</name>
               <displayName>C1SCR</displayName>
               <description>Status Set or Clear register           CPU1</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CH6S</name>
                     <description>processor 1 Transmit channel 6 status               set</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH5S</name>
                     <description>processor 1 Transmit channel 5 status               set</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH4S</name>
                     <description>processor 1 Transmit channel 4 status               set</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH3S</name>
                     <description>processor 1 Transmit channel 3 status               set</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH2S</name>
                     <description>processor 1 Transmit channel 2 status               set</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH1S</name>
                     <description>processor 1 Transmit channel 1 status               set</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH6C</name>
                     <description>processor 1 Receive channel 6 status               clear</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH5C</name>
                     <description>processor 1 Receive channel 5 status               clear</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH4C</name>
                     <description>processor 1 Receive channel 4 status               clear</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH3C</name>
                     <description>processor 1 Receive channel 3 status               clear</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH2C</name>
                     <description>processor 1 Receive channel 2 status               clear</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH1C</name>
                     <description>processor 1 Receive channel 1 status               clear</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>C1TO2SR</name>
               <displayName>C1TO2SR</displayName>
               <description>CPU1 to CPU2 status register</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CH6F</name>
                     <description>processor 1 transmit to process 2               Receive channel 6 status flag</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH5F</name>
                     <description>processor 1 transmit to process 2               Receive channel 5 status flag</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH4F</name>
                     <description>processor 1 transmit to process 2               Receive channel 4 status flag</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH3F</name>
                     <description>processor 1 transmit to process 2               Receive channel 3 status flag</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH2F</name>
                     <description>processor 1 transmit to process 2               Receive channel 2 status flag</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH1F</name>
                     <description>processor 1 transmit to process 2               Receive channel 1 status flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>C2CR</name>
               <displayName>C2CR</displayName>
               <description>Control register CPU2</description>
               <addressOffset>0x10</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TXFIE</name>
                     <description>processor 2 Transmit channel free               interrupt enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXOIE</name>
                     <description>processor 2 Receive channel occupied               interrupt enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>C2MR</name>
               <displayName>C2MR</displayName>
               <description>Mask register CPU2</description>
               <addressOffset>0x14</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0xFFFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>CH6FM</name>
                     <description>processor 2 Transmit channel 6 free               interrupt mask</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH5FM</name>
                     <description>processor 2 Transmit channel 5 free               interrupt mask</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH4FM</name>
                     <description>processor 2 Transmit channel 4 free               interrupt mask</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH3FM</name>
                     <description>processor 2 Transmit channel 3 free               interrupt mask</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH2FM</name>
                     <description>processor 2 Transmit channel 2 free               interrupt mask</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH1FM</name>
                     <description>processor 2 Transmit channel 1 free               interrupt mask</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH6OM</name>
                     <description>processor 2 Receive channel 6 occupied               interrupt enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH5OM</name>
                     <description>processor 2 Receive channel 5 occupied               interrupt enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH4OM</name>
                     <description>processor 2 Receive channel 4 occupied               interrupt enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH3OM</name>
                     <description>processor 2 Receive channel 3 occupied               interrupt enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH2OM</name>
                     <description>processor 2 Receive channel 2 occupied               interrupt enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH1OM</name>
                     <description>processor 2 Receive channel 1 occupied               interrupt enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>C2SCR</name>
               <displayName>C2SCR</displayName>
               <description>Status Set or Clear register           CPU2</description>
               <addressOffset>0x18</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CH6S</name>
                     <description>processor 2 Transmit channel 6 status               set</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH5S</name>
                     <description>processor 2 Transmit channel 5 status               set</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH4S</name>
                     <description>processor 2 Transmit channel 4 status               set</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH3S</name>
                     <description>processor 2 Transmit channel 3 status               set</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH2S</name>
                     <description>processor 2 Transmit channel 2 status               set</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH1S</name>
                     <description>processor 2 Transmit channel 1 status               set</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH6C</name>
                     <description>processor 2 Receive channel 6 status               clear</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH5C</name>
                     <description>processor 2 Receive channel 5 status               clear</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH4C</name>
                     <description>processor 2 Receive channel 4 status               clear</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH3C</name>
                     <description>processor 2 Receive channel 3 status               clear</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH2C</name>
                     <description>processor 2 Receive channel 2 status               clear</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH1C</name>
                     <description>processor 2 Receive channel 1 status               clear</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>C2TOC1SR</name>
               <displayName>C2TOC1SR</displayName>
               <description>CPU2 to CPU1 status register</description>
               <addressOffset>0x1C</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CH6F</name>
                     <description>processor 2 transmit to process 1               Receive channel 6 status flag</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH5F</name>
                     <description>processor 2 transmit to process 1               Receive channel 5 status flag</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH4F</name>
                     <description>processor 2 transmit to process 1               Receive channel 4 status flag</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH3F</name>
                     <description>processor 2 transmit to process 1               Receive channel 3 status flag</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH2F</name>
                     <description>processor 2 transmit to process 1               Receive channel 2 status flag</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH1F</name>
                     <description>processor 2 transmit to process 1               Receive channel 1 status flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HWCFGR</name>
               <displayName>HWCFGR</displayName>
               <description>IPCC Hardware configuration           register</description>
               <addressOffset>0x3F0</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000006</resetValue>
               <fields>
                  <field>
                     <name>CHANNELS</name>
                     <description>Number of channels per CPU supported by               the IP, range 1 to 16</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
